{
  "pageTitle" : "Adex Leads",
  "pageType"  : "project",
  "sections" :{
    "section" : {
        "idSection" : "1",
        "contentSection" : {
            "titleSection" : " Adex Leads ",
            "titleLink" : "",
            "textSection" : ""
        }
    },
    "project":{
      "header" : "Le projet",
      "text"   : "Adex-Leads est une application web développée à destination des équipes commerciales d'Adexgroup dans le but de disposer d'une meilleure gestion des \"leads\" commerciaux, autrement dit, les pistes commerciales.<br/>"
    },
    "context": {
      "header" : "Contexte",
      "text"   : "L'application avait été mise en place et développée par l'alternant qui m'avait précédé, la stack étant fortement typée front-end avec un traitement des données en base quasiment intégralement faite dans des grilles Javascript. Cependant, de nombreux bugs ont été décelés après son départ et on m'a chargé de reprendre la solution pour les corriger et y ajouter des fonctionnalités."
    },
    "development" : {
      "header" : "Développement",
      "text"   : "Cette application web comportait deux points applicatifs forts: une partie serveur en PHP, gérant les différentes requêtes à faire sur la base de donnée MySQL mise en place. Et une seconde partie s'appuyant principalement sur la librairie jQuery <a href=\"https://datatables.net/\">DataTables</a>.<br/>J'ai dû d'abord me documenter sur cette dernière puis investiguer afin de trouver les différentes causes de bugs. Après m'être approprié la solution, j'ai pu ensuite y ajouter les fonctionnalités demandées."
    },
    "delivery" : {
      "header" : "Livraison",
      "text"   : "J'ai profité de cette période de développement sur cette solution pour lui créer un dépôt Git sur lequel j'ai continué à travailler afin d'en historiser les évolutions. J'ai également documenté le code et agrémenté un Wiki le concernant.<br/>La solution a été integrée évolution par évolution sur le serveur de production."
    },
    "moreInfos" : {
      "header" : "Annexe",
      "text"   : "Plus de détails sur les activités de <a href = \"http://adexgroup.netisse.eu/\">Adexgroup</a>."
    }
  }
}
