{
  "pageTitle" : "Adexbox",
  "pageType"  : "project",
  "sections" :{
    "section" : {
        "idSection" : "1",
        "contentSection" : {
            "titleSection" : " Adexbox ",
            "titleLink" : "",
            "textSection" : ""
        }
    },
    "project":{
      "header" : "Pourquoi",
      "text"   : "Adexgroup est historiquement concessionnaire Xerox; ayant orienté son business model vers le leasing ces dernières années, une de ses principales occupations est donc la facturation (à la page) des impressions. <br/>L'Adexbox a ainsi été développée dans le but de permettre la remontée de compteurs d'impressions des imprimantes leasées par Adexgroup.<br/>Composée d'un boîtier installé sur le réseau du client et d'un serveur récoltant les compteurs de la globalité du parc, elle permet la gestion et la consultation de ces derniers dans un logiciel de gestion, à des fins de facturation."
    },
    "context": {
      "header" : "Naissance",
      "text"   : "Lors de mon embauche, il était clair qu'une de mes principales missions serait de stabiliser et de faire évoluer la solution Adexbox.<br/> Les serveurs avaient besoin d'une mise à jour et d'une profonde optimisation, tandis que les boîtiers souffraient de problèmes de fiabilité logicielle et matérielle.<br/>Une autre problématique était également le coût élevé d'un boîtier, parfois peu rentable à installer chez certains clients au parc d'impression réduit."
    },
    "development" : {
      "header" : "Comment",
      "text"   : "Sur ce projet, j'ai travaillé principalement en collaboration avec un autre alternant, à la formation axée réseau et système. Avec la collaboration de notre directeur technique, nous avons passé les premiers mois à nous réapproprier l'outil et le documenter.<br/>Cela fait, nous avons reproduit l'environnement complet sur des serveurs de virtualisation, de sorte à pouvoir faire évoluer la solution sans impacter la production, et y faire des tests en bac à sable.<br/> Les serveurs ont ainsi été sécurisés, mis à jour aux dernières versions de leurs distributions Linux (Debian 5/6 vers 8). Pour ce faire, mon bagage système et scripting m'a été d'une grande aide et a pu s'étoffer par la même occasion. De nombreuses parties de la stack étant en BASH, il a souvent été nécessaire que nous ré-adaptions les scripts aux nouvelles versions de ce dernier.<br/> Il a également fallu scripter certains nettoyage de la mémoire du serveur.<br/>Les boîtiers ont également fait partie de la refonte de la solution, nous avons ainsi fait évoluer leur système tout en les mettant également aux dernières versions Linux et en réadaptant leurs scripts. A terme de ces opérations, le service s'est trouvé grandement stabilisé et nous a permis d'entreprendre des modernisations et des solutions alternatives aux boîtiers.<br/>Une des premiéres propositions d'évolution technique que j'ai exprimé en arrivant concernait le support matériel de l'Adexbox utilisant une ordinateur \"barebone\" obsolète, encombrant, lourd, au support logiciel compliqué (architecture matérielle non maintenue) et à l'alimentation proprétaire peu fiable, en plus d'être couteux.<br/>Aussi, nous avons commencé par réduire les coûts des boîtiers en réadaptant la solution en place sur Raspberry Pi réduisant les coûts de boîtiers de près de 70% tout en augmentant leur fiabilité. Pour que ma proposition soit entendue, il m'a fallu convaincre les différents décisionnaires: convaincre le directeur technique de l'avantage logistique et de la supériorité matérielle du nouveau support, mais également le directeur général de l'économie que ce changement impliquerait. <br/>Puis, afin d'accompagner la transition, j'ai, à  l'initiative de notre directeur technique, scripté un parser de boîte mail en PERL, et en faisant envoyer par mail leurs compteurs aux imprimantes uniques dans leur parc à l'adresse parsée, nous avons rendu le support physique dispensable dans tous les parcs contenant très peu d'imprimantes, permettant de surcroît de rapatrier des boîtiers déjà installés sur ce type de parcs, offrant ainsi une fenêtre de transition plus large dans le temps ainsi qu'un économie du nombre d'Adexbox à déployer.<br/>Un an plus tard, la solution ayant prouvé sa fiabilité ainsi que sa mâturité, nous lui avons ajouté une application embarquée à même les imprimantes via le SDK proprétaire Xerox. <br/>J'ai pensé et développé cette application en recueillant réguliérement les retours sur ses avancées, et le besoin exprimé par le directeur général, m'inspirant de mes expériences précédentes en méthodologie AGILE.<br/>Développée en Javascript/Xerox ConnectKey SDK pour la partie frontend, et en Node.js pour la partie backend, cette solution de recueil des informations d'impression a eu un tel succès qu'elle est aujourd'hui commercialisée par Adexgroup aux autres concessions Xerox."
    },
    "delivery" : {
      "header" : "Livraison",
      "text"   : "Cette solution, qui se divise en réalité en plusieurs projets, a fait l'objet de plusieurs dépôts Git, de sorte à historiser les évolutions, mais également d'une documentation intégrale (qui était quasi-inexistante à l'origine), du code, et de l'architecture matérielle de la solution.<br/>Elle est aujourd'hui stable, et prête à être maintenue ou pour de futures évolutions."
    },
    "moreInfos" : {
      "header" : "Annexe",
      "text"   : "Plus de détails sur les activités de <a href = \"http://adexgroup.netisse.eu/\">Adexgroup</a>."
    }
  }
}
