{
  "pageTitle" : "Node Source Improved",
  "pageType"  : "project",
  "sections" :{
    "section" : {
        "idSection" : "1",
        "contentSection" : {
            "titleSection" : "Node Source Improved",
            "titleLink" : "",
            "textSection" : ""
        }
    },
    "project":{
      "header" : "Le projet",
      "text"   : "Node Source Improved est un script permettant de déployer facilement et rapidement Node.js sur n'importe quelle distribution Linux basée sur Debian.<br/>"
    },
    "context": {
      "header" : "Contexte",
      "text"   : "Utilisant beaucoup le Raspberry Pi dans le cadre de mes différents projets, il m'est arrivé de vouloir déployer Node.js sur un Pi de première génération et de me heurter à plusieurs difficultés. <br/> <ul> <li> Les packages officiels de Debian (aptitude), ne permettent de récupérer qu'une très ancienne version de Node.js (0.10).</li> <li>Il est possible de compiler soi-même les sources, mais au vu de la puissance très limité du Pi 1, cela représente plusieurs heures de compilation. </li> <li>Il existe une solution existante pour l'ajout de sources de packages pré-compilés à aptitude, nommée Node Source, mais elle ne prend pas en charger l'architecture de processeurs utilisée par le Pi 1.(ARM6)</li><li>Node.js seul, ne fournit pas un environnement de production complet, il est nécessaire d'y ajouter différents outils pour pouvoir l'utiliser au quotidien afin d'héberger une application.</li></ul>"
    },
    "development" : {
      "header" : "Développement",
      "text"   : "J'ai donc repris le script existant que Node Source utilise pour permettre l'installation des sources, et y ai rajouté la possibilité d'ajouter certains outils afin de sécuriser le serveur, ainsi que PM2, un outil permettant la gestion des application sur le serveur mis en place.  <br/> Est ajouté également la gestion des sources à destination des processeurs ARM6. <br/>"
    },
    "delivery" : {
      "header" : "Usage",
      "text"   : "Ce script m'a servi à mettre en place un environnement à plusieurs reprise, dans mon travail ou dans mes projets personnels.<br/>Il a également été bien reçu lors d'une soutenance dédiée aux projets à destination de Linux, lors de ma troisième année de Bachelor à l'ESGI.<br/>"
    },
    "moreInfos" : {
      "header" : "Annexe",
      "text"   : "Lien vers le dépot <a href=\"https://github.com/Marma92/nodesourceimproved\">Git</a> du projet."
    }
  }
}
