{
  "pageTitle" : "Compétences Transverses",
  "pageType"  : "mono",
  "sections" :{
    "section" : {
        "idSection" : "1",
        "contentSection" : {
            "titleSection" : " Compétences Transverses ",
            "textSection" : ""
        }
      }
    },
  "skillsData":{
      "1":{
        "skillName" : "Prise de décisions",
        "skillDescription" : "",
        "skillExample" : "",
        "skillImage" : ""
      },
      "2":{
        "skillName" : "Communication",
        "skillDescription" : "Je suis un communiquant, que ce soit au sein d’une équipe, pour communiquer une avancée, un état d’esprit ou un ressenti, ou de manière générale pour exprimer, ou expliquer quelque chose, je sais me faire entendre, être clair, descriptif tout en restant concis. Sachant m’adapter à mon auditoire et ayant une bonne élocution, je suis grâce à mon parler, capable de présenter à un public, faire passer un message tout en étant convaincant pertinent et construit, que ce soit formel ou informel.",
        "skillExample" : "Cela m’a permis de par le passé de présenter des projets de développement de par le passé à une clientèle assez huppée, de permettre des conciliations au sein de mes équipes de développement ou de convaincre un supérieur hiérarchique de revenir sur un choix technique.",
        "skillImage" : "/public/imgs/communication.jpg"
      },
      "3":{
        "skillName" : "Être à l'écoute",
        "skillDescription" : "Je suis capable d’imaginer une solution logicielle, de lui choisir les technologies adaptées, d’en imaginer le développement et le découper en tâches atomiques, à distribuer et à réaliser.",
        "skillExample" : "déjà mené des projets de la demande à la mise en production avec succès, notamment chez BNP Paribas Arbitrage où un outil de lecture de logs massifs était nécessaire. ",
        "skillImage" : ""
      },
        "4":{
          "skillName" : "Maintien de la cohésion",
          "skillDescription" : "",
          "skillExample" : "",
          "skillImage" : ""
        },
        "5":{
          "skillName" : "Persévérance",
          "skillDescription" : "",
          "skillExample" : "",
          "skillImage" : ""
        },
        "6":{
          "skillName" : "Sens de l'analyse",
          "skillDescription" : "",
          "skillExample" : "",
          "skillImage" : ""
        },
    "length": 6
    }
}
